Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཟག་པ་རྣམས་ལ་མི་རྟོག་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding contaminants that were not previously understood.

source: ཟག་པ་རྣམས་ཀྱི་ཡང་དག་པ་ཡོངས་སུ་ཤེས་པའི་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the relinquishment of contaminants through true knowledge of contaminants.

source: ཟག་པ་རྣམས་ཀྱི་བག་ཆགས་ཀྱི་ཉིང་མཚམས་སྦྱོར་བ་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as relinquishing the connectivity associated with karmic imprints.

source: འདི་དག་ནི་ཟག་པ་ཟད་པའི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections with the power to exhaust the contaminants.

source: དེ་ལ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཆོས་འདི་དག་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པའོ་ཞེས་མི་འཇིགས་པ་དང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with first fearlessness, about which a complete and perfect buddha declares, ‘Are these qualities not those of perfect buddhahood?’

source: སངས་རྒྱས་རིགས་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the knowledge of buddhahood.

source: དམ་བཅས་པ་ལ་མ་ཞུམ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as unrelenting commitment.

source: ཐམས་ཅད་ཐུགས་སུ་ཆུད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the comprehension of everything.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐུགས་སུ་ཆུད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the comprehension of omniscience.

source: འཁོར་བརྒྱད་ཀྱི་ནང་ན་བག་ཚ་བ་མི་མངའ་ཞིང་། དམ་བཅས་པ་བརྟན་པོ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being unintimidated within the eightfold retinue and abiding by a firm resolve.

source: འདི་དག་ནི་མི་འཇིགས་པ་དང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the first fearlessness.

source: དེ་ལ་ཡང་དག་པར་ཟག་པ་ཟད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the genuine relinquishment of contaminants?

source: ཟག་པ་ཟད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the exhaustion of contaminants.

source: བག་ཆགས་སེལ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the erasing of karmic imprints.

source: སྐྱེ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as nonarising.

source: ཡོངས་སུ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as complete understanding.

source: དམ་བཅས་པ་ལ་འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱིས་མི་གཡོས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as a resolve that cannot be swayed by the eight worldly concerns.

source: རྣམ་པར་གྲོལ་བ་ལ་ཉམས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as unfailing liberation.

source: འདི་དག་ནི་མི་འཇིགས་པ་གཉིས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the second fearlessness.

source: དེ་ལ་ངེས་པར་འབྱིན་པའི་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the path to deliverance?

source: ལམ་ཐབས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as understanding the attainment of the path.

source: འཐོབ་པར་བྱེད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding liberation.

source: འགོག་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding cessation.

source: འཇུག་པར་བྱེད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding engagement.

source: རབ་ཏུ་འཇོག་པར་བྱེད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as resting.

source: རྣམ་པར་གྲོལ་བར་བྱེད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as fostering liberation.

source: འདི་དག་ནི་མི་འཇིགས་པ་གསུམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of the third fearlessness.

source: དེ་ལ་བར་དུ་གཅོད་པའི་ཆོས་ཀྱི་གཏམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the Dharma discourse on obstructing factors?

source: བར་དུ་གཅོད་པ་རྣམས་ལ་སྐྱེ་བ་མེད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as understanding the nonarising of obstacles.

source: མ་སྐྱེས་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding no birth.

source: ཆགས་པ་མེད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding detachment.

source: བར་དུ་གཅོད་པ་རྣམས་ཀྱི་ཁ་ན་མ་ཐོ་བ་མེད་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding the lack of unwholesomeness with respect to obstacles.

source: བར་དུ་གཅོད་པ་རྣམས་ལ་ཐེ་ཙོམ་མེད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as having no doubts with respect to obstacles.

source: བར་དུ་གཅོད་པ་རྣམས་ལ་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོས་ངེས་པ་དང་། མ་ངེས་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as understanding both the certain and uncertain nature of lesser, intermediate, and greater obstacles.

source: འདི་དག་ནི་བར་དུ་གཅོད་པའི་ཆོས་ཀྱི་གཏམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ།། །།
en: Such are the six perfections of the Dharma discourse on obstructing factors.

source: དེ་ལ་སྙིང་རྗེ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of great compassion?

source: སེམས་ཅན་ལ་ཕན་པ་དང་ལྡན་པའི་སྙིང་རྗེ་ཆེན་པོ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as great compassion that benefits sentient beings.

source: སེམས་མཉམ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the mind of equality.

source: སེམས་ཅན་རྣམས་ལ་གནོད་པ་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as undaunted acceptance of the harms inflicted by sentient beings.

source: སེམས་ཅན་ཉེ་བར་འོང་བ་རྣམས་ཐར་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as liberating any sentient being that one meets.

source: མོས་པ་ཇི་ལྟ་བ་བཞིན་ཡོན་ཏན་ལ་འཇོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as resting on any positive quality, just as one wishes.

source: འཁོར་བ་ལས་གྲོལ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as liberating from saṃsāra.

source: འདི་དག་ནི་སྙིང་རྗེ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of great compassion.

source: དེ་ལ་ཤའི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of purifying the physical eye?

source: སའི་ཁམས་དང་། ཆུའི་ཁམས་གཉིས་དང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the clarity of the elements of earth and water.

source: མེའི་ཁམས་དང་། རླུང་གི་ཁམས་གཉིས་ཀྱིས་བརྟན་ནས་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as vision based on the elements of fire and wind.

source: རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་རྣམས་འདྲེས་པའི་སྐྱོན་གྱིས་མ་འཁྲུགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being unaffected by unwholesome combinations of wind, bile, and phlegm.

source: སྤྱན་བལྟ་ན་སྡུག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as eyes that are delightful to behold.

source: རིགས་པར་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as correct visual perception.

source: མ་ལུས་པར་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as visual perception that is complete.

source: འདི་དག་ནི་ཤའི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of purifying the physical eye.

source: དེ་ལ་ལྷའི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of purifying the divine eye?

source: ལྷའི་སྤྱན་གྱིས་གཟུགས་ཀྱི་ལུས་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing physical bodies by means of the divine eye.

source: ནམ་མཁའི་ལུས་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing bodies made of the space element.

source: རྒུད་པ་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing decline.

source: དར་བ་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing expansion.

source: རྒྱུ་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing causes.

source: སོ་སོར་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing distinctly.

source: འདི་དག་ནི་ལྷའི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of purifying the divine eye.

source: དེ་ལ་ཤེས་རབ་ཀྱི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of purifying the eye of insight?

source: བསྒོམས་པས་འགྲུབ་པའི་ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing with the eye of insight accomplished through meditation.

source: མྱ་ངན་ལས་འདས་པ་ཐར་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the attainment of liberation beyond suffering.

source: མངོན་པར་བརྗོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as adherence to speaking.

source: གཟིགས་པ་ལ་རབ་ཏུ་གནས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as adherence to seeing.

source: བལྟ་བར་བྱ་བ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as correct perception of that which is to be seen.

source: འཇུག་པ་བྱང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as purified understanding.

source: འདི་དག་ནི་ཤེས་རབ་ཀྱི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of purifying the eye of insight.

source: དེ་ལ་ཆོས་ཀྱི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of purifying the Dharma eye?

source: ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཐོབ་པའི་རྒྱུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the causes for the attainment of the eighteen unique qualities.

source: དེ་དག་འཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the attainment of those.

source: རྣམ་པར་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the seeing of features.

source: ངོ་བོ་ཉིད་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the seeing of essences.

source: སྦྱོར་བ་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing connections.

source: ཆུད་མི་ཟ་བར་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as undiminished seeing.

source: འདི་དག་ནི་ཆོས་ཀྱི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of purifying the Dharma eye.

source: དེ་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of purifying the buddha eye?

source: སངས་རྒྱས་ཀྱི་སྤྱན་སྒྲིབ་པ་མེད་པས་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing with the unobscured buddha eye.

source: ཕན་པར་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing what benefits.

source: ངོ་བོ་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the seeing of essences.

source: རྣམ་པར་དབེན་པ་གཟིགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing disengagement.

source: འདི་དག་ནི་སངས་རྒྱས་ཀྱི་སྤྱན་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of purifying the buddha eye.

source: དེ་ལ་རང་བྱུང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the self-existent?

source: རང་བྱུང་ལྷུན་གྱིས་གྲུབ་པར་གནས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the spontaneous presence of the self-existent.

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as abiding exactly as one wishes.

source: རང་གི་སྤོང་བའི་རྒྱུ་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as attaining the causes for one’s own relinquishment.

source: རབ་ཏུ་དབྱེ་བ་ཤེས་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as discernment.

source: རྣམ་པ་ཐམས་ཅད་ལ་ཉེ་བར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the understanding of all features.

source: ཇི་ལྟ་བ་བཞིན་ཐམས་ཅད་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as precise knowledge of everything.

source: འདི་དག་ནི་རང་བྱུང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the self-existent.

source: དེ་ལ་རྣམ་པར་རོལ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of playfulness?

source: སྦྱིན་པའི་རྣམ་པར་སྨིན་པས་རྣམ་པར་འཕྲུལ་པ་ནི་དཔེར་ན་ཆུ་བོ་གང་གཱར་གདུགས་ལྔ་བརྒྱ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the magical display that is achieved through generosity, such as the five hundred parasols at the Gaṅgā.

source: གྲོང་ཁྱེར་དུ་གཤེགས་པ་ན་སེམས་ཅན་རྣམས་བདེ་བར་གྱུར་པ་དང་། སིལ་སྙན་རྣམས་མ་དཀྲོལ་བར་སྒྲ་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as sentient beings experiencing happiness as they enter a city and the sound of instruments being heard though no one is playing any.

source: དབང་པོ་མ་ཚང་བ་ཚང་བ་དང་འོད་གསལ་བ་རབ་ཏུ་འཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the completion and clarity of otherwise incomplete faculties.

source: འོད་ཟེར་མཐའ་ཡས་པ་འགྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the unfolding of infinite light rays.

source: ཡུལ་ཡངས་པ་ཅན་གྱི་ཕྱི་དང་ནང་ལོགས་སུ་སངས་རྒྱས་བརྒྱད་ཁྲི་བཞི་སྟོང་སྤྲུལ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the emanation of eighty-four thousand buddhas outside and within the city of Vaiśālī.

source: འཁོར་བརྒྱད་པོ་རྣམས་ལ་དུས་སུ་ཆོས་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the timely teaching of the Dharma to the eightfold retinue.

source: འདི་དག་ནི་རྣམ་པར་རོལ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of playfulness.

source: དེ་ལ་གཏིང་དཔག་དཀའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that are hard to fathom?

source: སྤྱོད་པ་ལ་ཚད་གཟུང་བར་མི་ནུས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as immeasurable activity.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བསྙེན་པར་དཀའ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline means the blessed buddhas are hard to follow.

source: བསམ་པ་ཆུད་མི་ཟ་ཞིང་འཛིན་པ་ལ་ཕ་རོལ་གནོན་པ་ནི་དཔེར་ན་གནོད་སྦྱིན་འདུལ་ཞིང་གླང་པོ་ཆེ་ནོར་སྐྱོང་དང་། སྦྲུལ་གདུག་པ་བཏུལ་ནས་འདི་ལྟར་མི་འཇིགས་པ་སྦྱིན་ནོ། །ཞེས་ཚིག་གིས་སྨྲས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as never squandering wishes and fulfilling them while overpowering others, as, for example, when the yakṣas were defeated, the elephant Dhanapāla was tamed, or the poisonous snakes were tamed with the words, ‘This is the gift of freedom from fear.’

source: འོད་ཟེར་ཅན་དུ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་མ་བཏུལ་བ་དང་། ཚུར་གཤེགས་པ་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་ནང་དུ་ལྷུང་བཟེད་ཀྱི་ཆུ་ཕོ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the training of Mahā­maudgalyāyana’s mother in the Marīcika Realm and his joining the order of mendicant monks in Jeta Grove when he arrived there.

source: ཤཱ་རིའི་བུས་སྨྲས་པ། སེམས་བཞི་སྐྱེས་ནས་ཞིག་གོ། །སྨྲས་པ། ཚད་མེད་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །འདི་ལྟ་སྟེ།
en: Concentration comprises the immeasurable qualities that Śāriputra spoke of with the words, ‘Four types of mind arise and disintegrate.’

source: དེ་བཞིན་གཤེགས་པས་ནམ་ཕྱེད་ན་ཕྲིན་ལས་མཛད་པར་གྱུར་པ་ན་གནམ་ལྕགས་ཕབ་ཀྱང་གྲོང་ཁྱེར་གྱི་མ་དད་པ་རྣམས་བཏུལ་ནས། སང་ནི་ངས་མངོན་པར་ཤེས་པ་དྲུག་གི་ཆོས་བཤད་པར་བྱའོ། །ཞེས་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the Thus-Gone One’s display of activities at midnight. As meteors fell from the sky, the faithless city dwellers were subdued, and he said, ‘Tomorrow I shall explain the Dharma of the six superknowledges.’

source: འདི་དག་ནི་གཏིང་དཔག་དཀའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that are hard to fathom.

source: དེ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་དྲུག་ཚན་བཅྭ་བརྒྱད་གང་ཞེ་ན།
en: “There are six perfections for each of the eighteen unique qualities of the buddhas.

source: དེ་ལ་ཅ་ཅོ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: What are the six perfections devoid of meaningless speech?

source: འདི་ལྟར་རྒྱ་ཆེར་སྟོན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as vast teachings.

source: འོད་མངོན་པར་འདུ་བྱེད་པ་རྣམ་པ་གསུམ་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as a demonstration of three types of conditioned light.

source: གཞན་གྱི་རྒྱུད་དག་ལ་གནོད་སེམས་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as freedom from hostility in the minds of others.

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་ཚིམ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as satisfying others in accordance with their wishes.

source: སྦྲང་མའི་སྦྲང་རྩི་མྱོང་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as providing an experience that is sweet as honey.

source: རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བར་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as teaching free from attachment and aggression.

source: འདི་དག་ནི་ཅ་ཅོ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections devoid of meaningless speech.

source: དེ་ལ་བསྙེལ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of freedom from forgetfulness?

source: དྲན་པ་རྒྱུན་མི་འཆད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as unbroken recollection.

source: ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་བསྔོ་བའི་དྲན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as correctly dedicated mindfulness.

source: སྦྱོར་བ་ཁ་ན་མ་ཐོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as engagements free from evil.

source: ཆོས་ཐམས་ཅད་མངོན་པར་གོ་བར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as instilling an understanding of all phenomena.

source: དུས་གསུམ་དུ་མ་བསྙེལ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as freedom from forgetfulness with respect to the three times.

source: གསུང་རབ་མ་བསྙེལ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as not forgetting the instructions.

source: འདི་དག་ནི་བསྙེལ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of freedom from forgetfulness.

source: དེ་ལ་སེམས་མཉམ་པར་བཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of mental equipoise?

source: སེམས་ལ་སྐྱེ་བ་མེད་པར་མཚུངས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as mind being beyond birth.

source: ཞེན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as freedom from attachments.

source: ཕྲད་པས་ཆོག་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as contentment toward everything one encounters.

source: གཞན་ལ་ཕན་པ་རྣམ་པར་དཔྱོད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as discernment that benefits others.

source: སེམས་ཚར་བཅད་ཅིང་ཀུན་ཏུ་འཛིན་པ་ཉེ་བར་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the subjugation and seizing of mind.

source: དུས་ཐམས་ཅད་དུ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་ལྷུན་གྱིས་གྲུབ་པར་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the spontaneous accomplishment of all wishes on all occasions.

source: འདི་དག་ནི་སེམས་མཉམ་པར་བཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of mental equipoise.

source: དེ་ལ་སོ་སོར་མ་བརྟགས་པའི་བཏང་སྙོམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of neutrality beyond distinctions?

source: བསམ་པ་གྲུབ་པ་བཏང་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as neutrality with respect to the accomplishment of wishes.

source: ཕ་རོལ་པོ་གཞན་ལ་རག་ལས་པ་ལ་བཏང་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as neutrality with respect to dependency on others.

source: སྙིང་རྗེའི་ཡོ་བྱད་བཏང་སྙོམས་པ་ནི་དཔེར་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as equanimity with respect to the articles of compassion, as exemplified by the seat of awakening.

source: ཐམས་ཅད་དུ་བཏང་སྙོམས་མ་གཏུགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as unblemished neutrality throughout all contexts.

source: ཆོས་སྟོན་པ་ན་བཏང་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as neutrality when teaching the Dharma.

source: ཆོས་བཤད་པ་བྱས་ནས་ལུས་ཀྱིས་གདམས་ངག་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the imparting of instructions by means of the body when teaching the Dharma.

source: འདི་དག་ནི་སོ་སོར་མ་བརྟགས་པའི་བཏང་སྙོམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of neutrality beyond distinctions.

source: དེ་ལ་ཐ་དད་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of nondifferentiation?

source: ཐ་དད་པའི་འདུ་ཤེས་ཀྱིས་མི་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as nonarising through the conception of difference.

source: དེ་བཞིན་ཉིད་དུ་འདུ་ཤེས་པས་ཕྱིན་ཅི་མ་ལོག་པར་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as nonerroneous arising through the conception of suchness.

source: ཡོད་པ་མ་ཡིན་པའི་འདུ་ཤེས་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the conception of nonexistence.

source: བདག་གི་ལུས་དང་གཞན་གྱི་ལུས་ལ་འཁྲུལ་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the absence of confusion with respect to the bodies of oneself and others.

source: འདུ་ཤེས་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as possessing conception.

source: ཐམས་ཅད་དེའི་ངོ་བོ་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as everything being devoid of essence.

source: འདི་དག་ནི་ཐ་དད་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of nondifferentiation.

source: དེ་ལ་འདུན་པ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of unfailing intention?

source: ཕ་རོལ་ལ་ཕན་པར་འདུན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the intention to benefit others.

source: བདག་ལ་ཕན་པར་འདུན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the intention to benefit oneself.

source: ཆོས་ཀྱི་གཞི་ལ་འདུན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being intent on the bases of the Dharma.

source: དུས་ཐམས་ཅད་དུ་འདུན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as intention for all occasions.

source: སྲེད་པ་སྤོང་བ་ལ་འདུན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as being intent on the relinquishment of craving.

source: མ་རིག་པ་སྤོང་བ་ལ་འདུན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being intent on the relinquishment of ignorance.

source: འདི་དག་ནི་འདུན་པ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of unfailing intention.

source: དེ་ལ་བརྩོན་འགྲུས་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of unfailing diligence?

source: ཐམས་ཅད་དུ་སོང་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as universal diligence.

source: གཞན་དད་པར་འགྱུར་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the diligence that instills faith in others.

source: གདུལ་བའི་དུས་ལ་སྡོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as remaining still at the time of training.

source: ཆོས་ལྟ་བ་མི་འདོར་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as not discarding the view of the Dharma.

source: ཡིག་འབྲུ་སྟོན་པ་ཟད་མི་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as an inexhaustible display of utterances.

source: དོན་མ་གཏུགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the inexhaustible meaning.

source: འདི་དག་ནི་བརྩོན་འགྲུས་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of unfailing diligence.

source: དེ་ལ་དྲན་པ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of unfailing mindfulness?

source: དྲན་པ་ལ་རྙོག་པ་མེད་པའི་དྲན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the recollection of unsullied mindfulness.

source: ཐག་རིང་པོ་དྲན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as mindfulness at a distance.

source: རིགས་པ་ཇི་ལྟ་བ་བཞིན་དྲན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as mindfulness in accord with reason.

source: མོས་པ་ཇི་ལྟ་བ་བཞིན་དྲན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as mindfulness that is just as wished for.
